spec/support/vcr_cassettes/bgs/base/create_proc_form.yml

---
http_interactions:
- request:
    method: get
    uri: https://localhost:4447/VnpProcFormWebServiceBean/VnpProcFormService?WSDL
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Host:
      - ".vba.va.gov"
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 26 May 2020 15:54:13 GMT
      Server:
      - Apache
      X-Frame-Options:
      - SAMEORIGIN
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml;charset=utf-8
    body:
      encoding: UTF-8
      string: |-
        <?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Oracle JAX-WS 2.1.5. --><definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://procFormService.services.vonapp.vba.va.gov/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://procFormService.services.vonapp.vba.va.gov/" name="VnpProcFormService">
        <types>
        <xsd:schema>
        <xsd:import namespace="http://procFormService.services.vonapp.vba.va.gov/" schemaLocation="http://linktestbepbenefits.vba.va.gov:80/VnpProcFormWebServiceBean/VnpProcFormService?xsd=1"/>
        </xsd:schema>
        </types>
        <message name="vnpProcFormFindByPrimaryKey">
        <part name="parameters" element="tns:vnpProcFormFindByPrimaryKey"/>
        </message>
        <message name="vnpProcFormFindByPrimaryKeyResponse">
        <part name="parameters" element="tns:vnpProcFormFindByPrimaryKeyResponse"/>
        </message>
        <message name="MessageFaultException">
        <part name="fault" element="tns:MessageFaultException"/>
        </message>
        <message name="findAllAsArray">
        <part name="parameters" element="tns:findAllAsArray"/>
        </message>
        <message name="findAllAsArrayResponse">
        <part name="parameters" element="tns:findAllAsArrayResponse"/>
        </message>
        <message name="vnpProcFormRemove">
        <part name="parameters" element="tns:vnpProcFormRemove"/>
        </message>
        <message name="vnpProcFormRemoveResponse">
        <part name="parameters" element="tns:vnpProcFormRemoveResponse"/>
        </message>
        <message name="vnpProcFormCreate">
        <part name="parameters" element="tns:vnpProcFormCreate"/>
        </message>
        <message name="vnpProcFormCreateResponse">
        <part name="parameters" element="tns:vnpProcFormCreateResponse"/>
        </message>
        <portType name="VnpProcFormService">
        <operation name="vnpProcFormFindByPrimaryKey">
        <input message="tns:vnpProcFormFindByPrimaryKey"/>
        <output message="tns:vnpProcFormFindByPrimaryKeyResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="findAllAsArray">
        <input message="tns:findAllAsArray"/>
        <output message="tns:findAllAsArrayResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpProcFormRemove">
        <input message="tns:vnpProcFormRemove"/>
        <output message="tns:vnpProcFormRemoveResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        <operation name="vnpProcFormCreate">
        <input message="tns:vnpProcFormCreate"/>
        <output message="tns:vnpProcFormCreateResponse"/>
        <fault message="tns:MessageFaultException" name="MessageFaultException"/>
        </operation>
        </portType>
        <binding name="VnpProcFormServicePortBinding" type="tns:VnpProcFormService">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="vnpProcFormFindByPrimaryKey">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="findAllAsArray">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpProcFormRemove">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        <operation name="vnpProcFormCreate">
        <soap:operation soapAction=""/>
        <input>
        <soap:body use="literal"/>
        </input>
        <output>
        <soap:body use="literal"/>
        </output>
        <fault name="MessageFaultException">
        <soap:fault name="MessageFaultException" use="literal"/>
        </fault>
        </operation>
        </binding>
        <service name="VnpProcFormService">
        <port name="VnpProcFormServicePort" binding="tns:VnpProcFormServicePortBinding">
        <soap:address location="http://linktestbepbenefits.vba.va.gov:80/VnpProcFormWebServiceBean/VnpProcFormService"/>
        </port>
        </service>
        </definitions>
    http_version: null
  recorded_at: Tue, 26 May 2020 15:54:14 GMT
- request:
    method: post
    uri: http://linktestbepbenefits.vba.va.gov/VnpProcFormWebServiceBean/VnpProcFormService
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://procFormService.services.vonapp.vba.va.gov/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
          <wsse:UsernameToken>
            <wsse:Username>VAgovAPI</wsse:Username>
          </wsse:UsernameToken>
          <vaws:VaServiceHeaders xmlns:vaws="http://vbawebservices.vba.va.gov/vawss">
            <vaws:CLIENT_MACHINE>192.168.1.239</vaws:CLIENT_MACHINE>
            <vaws:STN_ID>281</vaws:STN_ID>
            <vaws:applicationName>VAgovAPI</vaws:applicationName>
            <vaws:ExternalUid>26964654685619222</vaws:ExternalUid>
            <vaws:ExternalKey>abraham.lincoln@vets.gov</vaws:ExternalKey>
          </vaws:VaServiceHeaders>
        </wsse:Security>
        </env:Header><env:Body><tns:vnpProcFormCreate><arg0><compId><vnpProcId>3828728</vnpProcId><formTypeCd>21-686c</formTypeCd></compId><jrnDt>2020-05-26T15:54:13Z</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId></arg0></tns:vnpProcFormCreate></env:Body></env:Envelope>
    headers:
      Host:
      - ".vba.va.gov"
      Soapaction:
      - '"vnpProcFormCreate"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1228'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx/1.17.9
      Date:
      - Tue, 26 May 2020 15:54:15 GMT
      Content-Type:
      - text/xml; charset=utf-8
      Content-Length:
      - '737'
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><work:WorkContext
        xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXdKABR3ZWJsb2dpYy5hcHAudm5wLWVhcgAAANYAAAAjd2VibG9naWMud29ya2FyZWEuU3RyaW5nV29ya0NvbnRleHQABTIuMC44AAA=</work:WorkContext></S:Header><S:Body><ns2:vnpProcFormCreateResponse
        xmlns:ns2="http://procFormService.services.vonapp.vba.va.gov/"><return><compId><vnpProcId>3828728</vnpProcId><formTypeCd>21-686c</formTypeCd></compId><jrnDt>2020-05-26T10:54:13-05:00</jrnDt><jrnLctnId>281</jrnLctnId><jrnObjId>VAgovAPI</jrnObjId><jrnStatusTypeCd>U</jrnStatusTypeCd><jrnUserId>VAgovAPI</jrnUserId></return></ns2:vnpProcFormCreateResponse></S:Body></S:Envelope>
    http_version: null
  recorded_at: Tue, 26 May 2020 15:54:15 GMT
recorded_with: VCR 5.1.0
